%параметры, необходимые для работы программы 
% par(1)<==>par('dDivRb')
% par(2)<==>par('RaDivRb')
% par(3)<==>par('RQtubeDivRb')
% par(4)<==>par('Me')
% par(5)<==>par('Qe')
% par(6)<==>par('hh')
% par(7)<==>par('NN')
% par(8)<==>par('2u0qdotDivEb')
% par(9)<==>par('NZero')
% par(10)<==>par('Lmax')

function par = Param()
%Масса электрона гр
par = containers.Map('KeyType','char','ValueType','double');

par('Me') = 9.109e-28;

%Заряд электрона ед СГС
par('Qe') = 4.8032e-10; % г^1/2 * см^3/2 * с^-1
%Постоянная Планка СГС
par('hh') = 1.0545887-27;
%Боровский радиус RB 
%Rb=hh^2/(Me*Qe^2)
%Боровский радиус в сантиметрах
%Rb=0.5292e-8
%1 нанометр 1e-7 см
%Боровский радиус в нанометрах
Rb = 0.05292; 
%радиус атома водорода 0.53e-8 см
%Диаметр атома водорода 1.063e-8 см=0.1063e нм
%Атомная единица энергии
%Eb=Qe^2/Rb
%в электроновольтах
Eb=27.21; %*1.6022*10^-12 эрг, эрг=г * см^2 * с^-2
% период нанотрубки вдоль оси симметрии
d=20;
par('dDivRb')=d/Rb;
%Радиус атома в квантовом проводе 
Ra=1; 
par('RaDivRb')=Ra/Rb;
%Радиус квантового нанопровода
RQtube=20;
par('RQtubeDivRb')=RQtube/Rb;
%Число точек интегрирования
par('NN')=100;
%потенциальная энергия внутри квантовой точки эв
u0qdot = -10;
par('2u0qdotDivEb')=2*u0qdot/Eb;
%Число нудей функций Бесселя
par('NZero')=20;
%Максимальное число порядков для нулей функций Бесселя
par('Lmax')=9;
end